# Taps
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'

# Binaries
brew 'awscli'
brew 'bash' # Latest Bash version
brew 'coreutils' # Those that come with macOS are outdated
brew 'gh'
brew 'git'
brew 'grep'
brew 'httpie'
brew 'jq'
brew 'mackup'
brew 'mas' # Mac App Store manager
brew 'neovim'
brew 'pkg-config' # https://github.com/driesvints/dotfiles/issues/20
brew 'rvm'
brew 'ruby-build'
brew 'svn' # Needed to install fonts
brew 'tmux'
brew 'wget'

# Apps
cask '1password'
brew '1password-cli'
cask 'firefox'
cask 'google-chrome'
cask 'slack'
cask 'tuple'
cask 'visual-studio-code'
cask 'kitty'
cask 'ubersicht'
cask 'keepingyouawake'
cask 'flux'

# Fonts
cask 'font-mononoki-nerd-font'

# Mac App Store
# mas 'Byword', id: 420212497
