# Binaries
brew 'bash' # Latest Bash version
cask 'chatgpt'
brew 'coreutils' # Those that come with macOS are outdated
brew 'gh'
brew 'git'
brew 'grep'
brew 'httpie'
brew 'jq'
brew 'mas' # Mac App Store manager
brew 'neovim'
brew 'pkg-config' # https://github.com/driesvints/dotfiles/issues/20
brew 'ruby-build'
brew 'svn' # Needed to install fonts
brew 'tmux'
brew 'wget'

# Apps
cask 'box-drive'
cask 'nikitabobko/tap/aerospace'
cask 'FelixKratz/formulae/borders'
cask 'FelixKratz/formulae/sketchybar'
cask 'firefox'
cask 'flux'
cask 'google-chrome'
cask 'kitty'
cask 'keepingyouawake'
cask 'nikitabobko/tap/aerospace'
cask 'phoenix'
cask 'obsidian'
cask 'sf-symbols'
cask 'ubersicht'
cask 'visual-studio-code'
cask 'box-drive'
cask 'spotify'

# Fonts
cask 'font-mononoki-nerd-font'
cask 'font-hack-nerd-font'

# Mac App Store
# mas 'Byword', id: 420212497
